app/controllers/products_controller.rb

	def new
		@product = Product.new
		@products = Product.all
		@categorys = Category.all
---
SELECT "products".* FROM "products"
SELECT "categories".* FROM "categories"

	def create
		@product = Product.new(product_params)
		if @product.save
---
INSERT INTO "products" ("base_price", "category_id", "created_at", "details", "endbid", "name", "pic1", "pic2", "pic3", "pic4", "startbid", "status", "updated_at", "user_id", "youtube") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15) RETURNING "id"